app/controllers/entities_controller.rb

SELECT * FROM "entities" WHERE ("entities"."id" = 1)
---
  def index
      @entities = Entity.find(:all)

INSERT INTO "entities" ("created_at", "title", "updated_at", "description") VALUES('2009-09-24 22:38:33', NULL, '2009-09-24 22:38:33', NULL)
---
  def create
    @entity = Entity.new(params[:entity])
      if @entity.save

SELECT * FROM "entities" WHERE ("entities"."id" = 1)
---
  def show
    @entity = Entity.find(params[:id])