app/controllers/features_controller.rb

INSERT INTO "features" ("created_at", "title", "code", "entity_id", "updated_at", "description") VALUES('2009-10-19 22:36:12', 'Import', '<Import dll="FunctionalLib.dll />', 113, '2009-10-19 22:36:12', '<i>How to declare <strong>Import</strong></i>
---
  def create
    @feature = @entity.features.new(params[:feature])
      if @feature.save

SELECT * FROM "features" WHERE ("features"."id" = 2 AND ("features".entity_id = 108))
---
  def show
    @feature = @entity.features.find(params[:id])

SELECT * FROM "features" WHERE ("features"."id" = 13 AND ("features".entity_id = 112))
---
  def edit
    @feature = @entity.features.find(params[:id])

SELECT * FROM "features" WHERE ("features"."id" = 17 AND ("features".entity_id = 112))
UPDATE "features" SET "updated_at" = '2009-10-20 03:23:51', "description" = '<i>How to declare <strong>Plugin</strong></i>
---
  def update
    @feature = @entity.features.find(params[:id])
    @feature.update_attributes(params[:feature])