app/controllers/home_controller.rb

INSERT INTO "home" ("created_at", "updated_at", "value", "key") VALUES('2009-10-20 06:51:57', '2009-10-20 06:51:57', NULL, NULL)
---
  def create
    @home = Home.new(params[:id])
    @home.save