app/controllers/users_controller.rb

  def create
    @email = params[:email]
    @password = params[:pass]
    @user = User.find_by_email_and_password(@email, @password)
---
SELECT * FROM "users" WHERE ("users"."email" = 'ayayalar@mac.com' AND "users"."password" = 'mftsgs') LIMIT 1